embeddedci-com/examples/scenario-sensors-stm32/main.c
/*
 * STM32 scenario app:
 * - USART1 interactive menu (line-buffering off for interactive echo)
 * - rotor / stepper outputs on PC10/PC11
 *     * "rotors on/off" energises both pins (legacy rotor behaviour)
 *     * "stepmotor <n> [fwd|rev]" drives them as a step/direction stepper
 *       interface (PC10 = STEP pulse, PC11 = DIR), as for an A4988/DRV8825
 *     * "stepmotor <n> [fwd|rev] verify [seconds]" additionally samples the
 *       motor coil-current feedback on PA0 (ADC1_IN0 — the shunt/INA sense
 *       amplifier) while stepping, printing the peak-to-peak swing every
 *       `seconds` (default 1s) and stopping with STEP FAULT if the current
 *       goes flat *after* the motor has been seen running (a slow start keeps
 *       checking; motor stalled / open coil / driver dead)
 * - stepper health monitor: "monitor pwm [seconds]" measures a PWM feedback
 *   signal on PA0 (TIM2_CH1) each cycle and flags "failure detected" if the
 *   PWM stops after it has been seen (a slow start keeps waiting)
 * - BMP280 on I2C1 (PB8/PB9), auto-detect 0x76/0x77
 * - VL53L0X on same bus (default addr 0x29) for bus validation
 */

#include "stm32f4xx_hal.h"
#include "VL53L0X.h"
#include "i2c.h"
#include "motor_health.h"
#include <math.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>

#define CMD_BUF_SIZE 64
#define BMP280_CHIP_ID 0x58U
#define BMP280_REG_CHIP_ID 0xD0U
#define BMP280_REG_RESET 0xE0U
#define BMP280_REG_STATUS 0xF3U
#define BMP280_REG_CTRL_MEAS 0xF4U
#define BMP280_REG_CONFIG 0xF5U
#define BMP280_REG_PRESS_MSB 0xF7U
#define BMP280_REG_CALIB_START 0x88U

#define BMP280_I2C_ADDR0 0x76U
#define BMP280_I2C_ADDR1 0x77U
#define BMP280_TIMEOUT_MS 100U
#define BMP280_SEA_LEVEL_PA 101325.0f

#define VL53L0X_I2C_ADDR_7B 0x29U
#define VL53L0X_MODEL_ID_EXPECTED 0xEEU

#define I2C_SCAN_ADDR_FIRST 0x08U
#define I2C_SCAN_ADDR_LAST 0x77U
#define I2C_ISREADY_TRIALS 3U
#define I2C_ISREADY_TIMEOUT_MS 10U

/* Boot attach window (ms): main() holds this long before touching any peripheral
 * so a host flasher that just reset us (NRST, an eFuse power-cycle, or the UART
 * "reset" command below) can connect SWD and halt during a known-quiet window.
 * This app never repurposes PA13/PA14, so SWD stays available regardless, but the
 * window + software reset make attach/flash deterministic on rigs with no NRST. */
#define FLASH_ATTACH_WINDOW_MS 200U

/* Stepper (step/direction) on the former rotor pins.  PC10 = STEP (one motor
 * step per rising edge), PC11 = DIR (level selects rotation direction). This is
 * the signalling a common stepper driver module (A4988/DRV8825) expects. */
#define STEP_PORT GPIOC
#define STEP_PIN GPIO_PIN_10
#define DIR_PIN GPIO_PIN_11
/* Step pulse timing lives in motor_health.h (STEP_HIGH_US / STEP_PERIOD_US /
 * STEP_LOW_BUDGET_US) so the firmware and the host timing test share one source.
 *
 * We busy-wait on the DWT cycle counter (delay_us), not HAL_Delay: HAL_Delay's 1ms
 * tick granularity is too coarse — HAL_Delay(1) actually blocks 1-2 ticks, so two
 * per step ran the motor at only ~250 steps/s (half the intended rate).
 *
 * The pulse period is held *strictly* constant regardless of the verify work: the
 * STEP pin is high for STEP_HIGH_US, then the coil-current sampling / bookkeeping
 * runs during the low phase, and we pad the low phase so the whole step always
 * lasts STEP_PERIOD_US. As long as the verify work fits STEP_LOW_BUDGET_US the pulse
 * train stays clean even at a very short verify interval; anything that doesn't fit
 * is counted as an overrun so a test can catch it instead of the pulses slipping. */
#define STEP_MAX_COUNT 100000U

/* PWM feedback monitor.  We measure the PWM on PA0 (TIM2_CH1) using the timer's
 * PWM-input mode: CH1 (rising) captures the period, CH2 (falling) the high time. */
#define PWM_MON_DEFAULT_SEC 5U
#define PWM_MON_MIN_SEC 1U
#define PWM_MON_MAX_SEC 3600U
#define PWM_MEAS_WINDOW_MS 400U /* no edge within this window = signal lost */
#define PWM_TIM_HZ 1000000U     /* timer timebase: 1 MHz -> 1 tick = 1 us */
/* "stepmotor <n> ... verify [ms]" samples the coil-current feedback on PA0 to
 * check the motor is actually turning while we drive STEP. The optional argument
 * is the check interval in MILLISECONDS (default 1000): each interval the coil
 * swing is evaluated and a fault stops the move, so a sub-second value catches a
 * fault faster. The floor spans several electrical cycles of the stepper so a
 * window always contains a full swing (at ~500 steps/s one cycle is ~8 ms). */
#define STEP_VERIFY_DEFAULT_MS 1000U
#define STEP_VERIFY_MIN_MS 50U
#define STEP_VERIFY_MAX_MS 3600000U
/* Healthy "motor ok" lines are throttled to at most one per this interval so a
 * sub-second check interval doesn't flood the console; a fault always prints. */
#define STEP_VERIFY_PRINT_MIN_MS 1000U

/* Motor-health check via the coil-current sense on PA0 (ADC1_IN0). PA0 carries the
 * shunt-resistor voltage through an INA sense amplifier, so a *running* motor makes
 * the reading swing as each step energises/de-energises the coil, while a stalled
 * or open coil (or a dead driver) leaves it sitting flat at a DC bias. The
 * peak-to-peak decision (ADC_VREF_MV / MOTOR_SWING_MIN_MV / motor_swing_is_fault)
 * lives in motor_health.h so the host unit test can exercise it against real
 * captured data. 12-bit ADC against the 3.3 V VREF+ on the NUCLEO-F446RE. */

typedef struct
{
    uint16_t dig_T1;
    int16_t dig_T2;
    int16_t dig_T3;
    uint16_t dig_P1;
    int16_t dig_P2;
    int16_t dig_P3;
    int16_t dig_P4;
    int16_t dig_P5;
    int16_t dig_P6;
    int16_t dig_P7;
    int16_t dig_P8;
    int16_t dig_P9;
    int32_t t_fine;
} bmp280_calibration_t;

typedef struct
{
    I2C_HandleTypeDef hi2c1;
    uint8_t i2c_addr_7b;
    uint8_t detected;
    uint8_t initialized;
    uint32_t read_count;
    uint32_t read_fail_count;
    float temperature_c;
    float pressure_pa;
    float altitude_m;
} sensor_state_t;

typedef struct
{
    uint8_t detected;
    uint8_t initialized;
    uint8_t last_model_id;
    uint16_t last_range_mm;
    uint32_t read_count;
    uint32_t read_fail_count;
} vl53l0x_state_t;

static volatile char cmd_buffer[CMD_BUF_SIZE];
static volatile uint8_t cmd_index = 0;
static volatile uint8_t cmd_ready = 0;

