embeddedci-com/examples/scenario-sensors-stm32/main.c
static uint8_t rx_byte;
static volatile uint32_t rx_byte_count = 0;
static volatile uint32_t command_count = 0;
static uint8_t rx_last_was_cr = 0U;

/* Interrupt-driven RX ring buffer.  USART1 has a single RDR (no RX FIFO) and the
 * main loop sleeps in __WFI between SysTicks, so polling RDR drops bytes on a
 * back-to-back burst — a host command sent at line rate (~87 us/byte @115200)
 * overruns RDR and the loop sees only the first byte or two.  An RX interrupt
 * drains RDR the moment each byte lands into this ring; readers consume it. */
#define RX_RING_SIZE 256u
static volatile uint8_t  rx_ring[RX_RING_SIZE];
static volatile uint16_t rx_ring_head = 0;   /* written by the ISR  */
static volatile uint16_t rx_ring_tail = 0;   /* read by the main loop */

static sensor_state_t g_sensor;
static bmp280_calibration_t g_calib;
static vl53l0x_state_t g_vl53;
static struct VL53L0X g_vl53_dev;
static uint8_t g_i2c1_hw_inited = 0U;
static TIM_HandleTypeDef g_pwm_tim;
static ADC_HandleTypeDef g_adc;

void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void USART1_Init(void);
static void I2C1_Init(void);
static int i2c1_ensure_init(void);
void HAL_I2C_MspInit(I2C_HandleTypeDef *hi2c);
void HAL_I2C_MspDeInit(I2C_HandleTypeDef *hi2c);
static int usart1_read_byte_nonblocking(uint8_t *byte);
static void uart_process_rx_byte(uint8_t byte);
static void print_prompt(void);
static void process_command(char *cmd);
static void print_help(void);
static void print_status(void);
static void set_rotors(GPIO_PinState state);
static uint32_t parse_u32_default(const char *s, uint32_t defval);
static void cycle_counter_init(void);
static void delay_us(uint32_t us);
static uint32_t cyc_to_us(uint32_t cycles);

/* Pulse-timing instrumentation filled in by stepmotor_move so a fault/summary (and
 * the HIL test) can prove the verify work never disturbs the STEP pulse train:
 *  - budget_us: microseconds the in-line verify work must fit within each step
 *    (the low phase, STEP_PERIOD_US - STEP_HIGH_US).
 *  - worst_verify_us: longest per-step verify work actually measured (excludes the
 *    throttled human-readable status print, which is an intentional rare stall).
 *  - overruns: steps whose verify work exceeded budget_us (0 == pulses stayed clean).
 *  - stalls: steps that blocked on a throttled status print (bounded, ~1/s). */
typedef struct
{
    uint32_t budget_us;
    uint32_t worst_verify_us;
    uint32_t overruns;
    uint32_t stalls;
} step_timing_t;

static uint32_t stepmotor_move(uint32_t steps, int reverse, int verify, uint32_t verify_ms,
                               int *motor_fault, step_timing_t *timing);
static void handle_stepmotor(const char *args);
static void pwm_input_init(void);
static void pwm_input_deinit(void);
static int pwm_measure(uint32_t *freq_hz, uint32_t *duty_pct, uint32_t *period_us);
static void adc_input_init(void);
static void adc_input_deinit(void);
static uint16_t adc_sample(void);
static void monitor_pwm_until_key(uint32_t period_sec);
void HAL_TIM_IC_MspInit(TIM_HandleTypeDef *htim);
void HAL_TIM_IC_MspDeInit(TIM_HandleTypeDef *htim);
static void monitor_i2c_until_key(void);
static void sensor_init_until_key(void);
static int bmp280_probe_and_init(uint8_t verbose);
static int bmp280_read_measurement(float *temperature_c, float *pressure_pa, float *altitude_m);
static int bmp280_read_regs(uint8_t reg, uint8_t *buf, uint16_t len, uint8_t verbose);
static int bmp280_write_reg(uint8_t reg, uint8_t value, uint8_t verbose);
static void i2c_dump_hal_context(const char *tag, HAL_StatusTypeDef st);
static void i2c_dump_hal_error_bits(uint32_t err);
static void i2c_recover(void);
static void i2c_bus_scan(void);
static int vl53l0x_init(uint8_t verbose);
static int vl53l0x_read_model_id(uint8_t verbose);
static int vl53l0x_read_range_mm(uint16_t *range_mm, uint8_t verbose);
static int sensor_i2c_deinit(void);
static const char *hal_status_to_str(HAL_StatusTypeDef status);
static int32_t bmp280_compensate_temp(int32_t adc_T);
static uint32_t bmp280_compensate_press(int32_t adc_P);
static float pressure_to_altitude_m(float pressure_pa);
static int32_t round_float_to_int(float value);
static int32_t round_float_to_centi(float value);
static void fault_led_prepare(void);
static void fault_led_delay(volatile uint32_t cycles);
static void fault_led_blink_loop(uint32_t pulses) __attribute__((noreturn));

int _write(int file, char *ptr, int len)
{
    (void)file;
    for (int i = 0; i < len; i++)
    {
        while ((USART1->SR & USART_SR_TXE) == 0U)
        {
        }
        USART1->DR = (uint8_t)ptr[i];
    }
    return len;
}

int main(void)
{
    HAL_Init();
    SystemClock_Config();

    /* Flash-friendliness: keep the debug port (SWD) fully alive even while the
     * app sleeps in __WFI(), so a host can always attach/halt/flash without a
     * hardware reset line. */
    HAL_DBGMCU_EnableDBGSleepMode();
    HAL_DBGMCU_EnableDBGStopMode();
    HAL_DBGMCU_EnableDBGStandbyMode();

    /* Give a flasher a clean, quiet window to connect SWD and halt right after a
     * reset, before we start driving GPIO / I2C / UART. See FLASH_ATTACH_WINDOW_MS. */
    HAL_Delay(FLASH_ATTACH_WINDOW_MS);

    MX_GPIO_Init();
    USART1_Init();
    cycle_counter_init(); /* DWT cycle counter for accurate step-pulse timing */
    (void)setvbuf(stdout, NULL, _IONBF, 0);

    memset(&g_sensor, 0, sizeof(g_sensor));
    memset(&g_vl53, 0, sizeof(g_vl53));
    memset(&g_vl53_dev, 0, sizeof(g_vl53_dev));
    g_vl53_dev.io_2v8 = true;
    g_vl53_dev.address = VL53L0X_I2C_ADDR_7B;
    g_vl53_dev.io_timeout = BMP280_TIMEOUT_MS;
    g_vl53_dev.did_timeout = false;
    I2C1_Init();
    (void)bmp280_probe_and_init(1U);
    printf("\r\nVL53L0X init (boot):\r\n");
    (void)vl53l0x_init(1U);

    HAL_Delay(50);
    printf("\r\nSCENARIO: stm32 bmp280 + vl53l0x + rotor control\r\n");
    printf("SCENARIO: build=%s %s\r\n", __DATE__, __TIME__);
    printf("SCENARIO: cpu=%lu Hz\r\n", HAL_RCC_GetHCLKFreq());
    printf("SCENARIO: uart=USART1(115200), i2c=I2C1 PB8/PB9\r\n");
    printf("APP_OK\r\n");
    printf("type a command and press Enter (e.g. help)\r\n");
    print_prompt();

    while (1)
    {
        while (usart1_read_byte_nonblocking(&rx_byte))
        {
            uart_process_rx_byte(rx_byte);
        }

        if (cmd_ready)
        {
            cmd_ready = 0;
            process_command((char *)cmd_buffer);
            memset((void *)cmd_buffer, 0, CMD_BUF_SIZE);
            cmd_index = 0;
            print_prompt();
        }

        __WFI();
    }
}

static void print_prompt(void)
{
    printf("> ");
    (void)fflush(stdout);
}

/* RX interrupt: drain RDR (and clear a possible overrun) into the ring the moment
 * bytes arrive, so a line-rate burst is never lost while the main loop is asleep.
 * Reading DR clears RXNE; reading SR then DR clears ORE. */
void USART1_IRQHandler(void)
{
    while ((USART1->SR & (USART_SR_RXNE | USART_SR_ORE)) != 0U)
    {
        uint8_t byte = (uint8_t)(USART1->DR & 0xFFU);
        uint16_t next = (uint16_t)((rx_ring_head + 1U) % RX_RING_SIZE);
        if (next != rx_ring_tail)      /* drop on full rather than clobber unread */
        {
            rx_ring[rx_ring_head] = byte;
            rx_ring_head = next;
        }
    }
}

