embeddedci-com/examples/scenario-sensors-stm32/main.c
        printf("  temperature=%s%lu.%02lu C\r\n",
               (temp_centi < 0) ? "-" : "",
               (unsigned long)(temp_abs_centi / 100U),
               (unsigned long)(temp_abs_centi % 100U));
        printf("  pressure=%ld Pa\r\n", (long)pressure_pa_i);
        printf("  altitude=%s%lu.%02lu m\r\n",
               (altitude_centi < 0) ? "-" : "",
               (unsigned long)(altitude_abs_centi / 100U),
               (unsigned long)(altitude_abs_centi % 100U));
    }
    else
    {
        printf("  sensor_read=FAILED\r\n");
    }
    printf("  read_count=%lu fail_count=%lu\r\n",
           (unsigned long)g_sensor.read_count,
           (unsigned long)g_sensor.read_fail_count);
    printf("  rx_byte_count=%lu\r\n", (unsigned long)rx_byte_count);
    printf("  command_count=%lu\r\n", (unsigned long)command_count);
    printf("  tick=%lu ms\r\n", (unsigned long)HAL_GetTick());
}

static void set_rotors(GPIO_PinState state)
{
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_10 | GPIO_PIN_11, state);
}

/* Parse the first unsigned decimal integer in s; return defval if none present. */
static uint32_t parse_u32_default(const char *s, uint32_t defval)
{
    while (*s == ' ')
    {
        s++;
    }
    if (*s < '0' || *s > '9')
    {
        return defval;
    }
    uint32_t v = 0U;
    while (*s >= '0' && *s <= '9')
    {
        v = (v * 10U) + (uint32_t)(*s - '0');
        s++;
    }
    return v;
}

/* Enable the Cortex-M4 DWT cycle counter so delay_us() can busy-wait with
 * sub-millisecond accuracy (HAL_Delay only resolves whole 1ms ticks). */
static void cycle_counter_init(void)
{
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
    DWT->CYCCNT = 0U;
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;
}

/* Busy-wait `us` microseconds using the DWT cycle counter. Wraparound is handled
 * naturally by unsigned subtraction. Used for the step pulse timing so the motor
 * runs at the intended rate instead of HAL_Delay's coarse 1-2ms-per-call floor. */
static void delay_us(uint32_t us)
{
    uint32_t start = DWT->CYCCNT;
    uint32_t ticks = us * (SystemCoreClock / 1000000U);
    while ((DWT->CYCCNT - start) < ticks)
    {
        /* spin */
    }
}

/* Convert a DWT cycle delta to microseconds (integer, truncating). */
static uint32_t cyc_to_us(uint32_t cycles)
{
    return cycles / (SystemCoreClock / 1000000U);
}

/* Drive PC10 (STEP) with `steps` pulses; PC11 (DIR) selects direction.
 * Returns the number of steps actually issued (a key press aborts early).
 *
 * When `verify` is set the caller has already brought up the ADC on PA0
 * (ADC1_IN0 — the coil-current sense). We take one ADC reading per step and track
 * the min/max over each `verify_ms` window: a running motor makes the coil-current
 * reading swing step-to-step, so a healthy interval shows a wide peak-to-peak
 * swing, while a stalled/open coil sits flat.
 *
 * A flat interval is only a fault once the motor has actually been seen running:
 * we latch "coil current seen" the first time an interval swings above
 * MOTOR_SWING_MIN_MV, and only a collapse back to flat *after* that stops the
 * move (sets *motor_fault, returns early). A flat reading before the first swing
 * just means the motor hasn't spun up yet, so we keep checking the next
 * intervals rather than faulting on a slow start. */
static uint32_t stepmotor_move(uint32_t steps, int reverse, int verify, uint32_t verify_ms,
                               int *motor_fault, step_timing_t *timing)
{
    if (motor_fault != NULL)
    {
        *motor_fault = 0;
    }

    /* The verify work (ADC sample + interval bookkeeping) shares each step with the
     * pulse: it runs in the low phase and must fit this budget or the pulse slips. */
    const uint32_t budget_us = STEP_LOW_BUDGET_US;
    uint32_t worst_verify_us = 0U;
    uint32_t overruns = 0U;
    uint32_t stalls = 0U;

    HAL_GPIO_WritePin(STEP_PORT, DIR_PIN, reverse ? GPIO_PIN_SET : GPIO_PIN_RESET);
    HAL_Delay(1); /* let DIR settle before the first STEP edge */

    /* First check one interval in, giving the motor time to spin up before we
     * expect any coil-current swing (an immediate check would see a flat reading). */
    uint32_t next_verify_ms = HAL_GetTick() + verify_ms;
    /* Healthy status is printed at most once per STEP_VERIFY_PRINT_MIN_MS even when
     * the check interval is shorter, so a sub-second interval doesn't flood output. */
    uint32_t last_print_ms = HAL_GetTick();
    uint32_t cycle = 0U;
    uint32_t done = 0U;
    uint16_t adc_min = 0xFFFFU; /* min/max of the coil-current reading this interval */
    uint16_t adc_max = 0U;
    int motor_seen = 0; /* latched once an interval swings above the flat threshold */
    for (uint32_t i = 0U; i < steps; i++)
    {
        if (usart1_read_byte_nonblocking(&rx_byte))
        {
            break; /* any key aborts a long move */
        }

        /* Strict-period step: high for STEP_HIGH_US, then all verify work in the low
         * phase, then pad the low phase so the whole step lasts STEP_PERIOD_US. */
        uint32_t step_start = DWT->CYCCNT;
        HAL_GPIO_WritePin(STEP_PORT, STEP_PIN, GPIO_PIN_SET);
        delay_us(STEP_HIGH_US);
        HAL_GPIO_WritePin(STEP_PORT, STEP_PIN, GPIO_PIN_RESET);
        done++;

        int printed = 0; /* a blocking status line was emitted this step (rare stall) */
        if (verify)
        {
            uint32_t work_start = DWT->CYCCNT;
            uint16_t s = adc_sample(); /* coil-current sense on PA0 for this step */
            if (s < adc_min)
            {
                adc_min = s;
            }
            if (s > adc_max)
            {
                adc_max = s;
            }

            uint32_t now = HAL_GetTick();
            int interval = (int32_t)(now - next_verify_ms) >= 0;
            uint32_t min_mv = 0U, max_mv = 0U, vpp_mv = 0U;
            int fault = 0;
            int seen_fault = 0;
            int want_print = 0;
            if (interval)
            {
                cycle++;
                min_mv = adc_counts_to_mv(adc_min);
                max_mv = adc_counts_to_mv(adc_max);
                vpp_mv = motor_swing_vpp_mv(adc_min, adc_max);
                fault = motor_swing_is_fault(adc_min, adc_max);
                seen_fault = fault && motor_seen; /* running then flat -> real fault */
                if (!fault)
                {
                    motor_seen = 1; /* latch that we've seen the motor running */
                }
                /* A fault always prints; otherwise throttle to one line per interval-second. */
                want_print = seen_fault ||
                             ((int32_t)(now - last_print_ms) >= (int32_t)STEP_VERIFY_PRINT_MIN_MS);
            }

