embeddedci-com/examples/scenario-sensors-stm32/main.c
            /* Record the verify-work time BEFORE the (blocking) status print so the
             * measured cost is just the every-step work, not the rare human print. */
            uint32_t verify_us = cyc_to_us(DWT->CYCCNT - work_start);
            if (verify_us > worst_verify_us)
            {
                worst_verify_us = verify_us;
            }
            if (verify_us > budget_us)
            {
                overruns++;
            }

            if (interval)
            {
                if (want_print)
                {
                    if (seen_fault)
                    {
                        printf("  verify cycle=%lu tick=%lu ms step=%lu/%lu failure detected: coil current went flat on PA0, Vpp=%lu mV < %u mV (motor stalled / open coil)\r\n",
                               (unsigned long)cycle, (unsigned long)now, (unsigned long)done,
                               (unsigned long)steps, (unsigned long)vpp_mv,
                               (unsigned int)MOTOR_SWING_MIN_MV);
                    }
                    else if (fault)
                    {
                        printf("  verify cycle=%lu tick=%lu ms step=%lu/%lu waiting: coil current still flat on PA0, Vpp=%lu mV < %u mV (motor not spinning yet)\r\n",
                               (unsigned long)cycle, (unsigned long)now, (unsigned long)done,
                               (unsigned long)steps, (unsigned long)vpp_mv,
                               (unsigned int)MOTOR_SWING_MIN_MV);
                    }
                    else
                    {
                        printf("  verify cycle=%lu tick=%lu ms step=%lu/%lu motor ok: coil Vpp=%lu mV (min=%lu mV max=%lu mV)\r\n",
                               (unsigned long)cycle, (unsigned long)now, (unsigned long)done,
                               (unsigned long)steps, (unsigned long)vpp_mv,
                               (unsigned long)min_mv, (unsigned long)max_mv);
                    }
                    last_print_ms = now;
                    printed = 1;
                    stalls++;
                }
                adc_min = 0xFFFFU; /* reset the window for the next interval */
                adc_max = 0U;
                next_verify_ms += verify_ms;

                if (seen_fault)
                {
                    if (motor_fault != NULL)
                    {
                        *motor_fault = 1;
                    }
                    break; /* stop the move the moment the coil current goes flat */
                }
            }
        }

        /* Pad the low phase to hold the strict period. Skipped after a status print:
         * that line blocks longer than a whole step, so we take the one-off stall
         * (counted above) and resume on the next step rather than trying to catch up. */
        if (!printed)
        {
            uint32_t used_us = cyc_to_us(DWT->CYCCNT - step_start);
            uint32_t pad_us = step_pad_us(STEP_PERIOD_US, used_us, NULL);
            if (pad_us > 0U)
            {
                delay_us(pad_us);
            }
        }
    }

    if (timing != NULL)
    {
        timing->budget_us = budget_us;
        timing->worst_verify_us = worst_verify_us;
        timing->overruns = overruns;
        timing->stalls = stalls;
    }
    return done;
}

/* "stepmotor <n> [fwd|rev] [verify [ms]]" — args points just past "stepmotor".
 * After the count the direction and the verify option may appear in any order;
 * "verify" turns on the coil-current check (see stepmotor_move), with an optional
 * check interval in milliseconds. */
static void handle_stepmotor(const char *args)
{
    while (*args == ' ')
    {
        args++;
    }
    if (*args < '0' || *args > '9')
    {
        printf("usage: stepmotor <n> [fwd|rev] [verify [ms]]\r\n");
        return;
    }

    uint32_t steps = 0U;
    const char *p = args;
    while (*p >= '0' && *p <= '9')
    {
        steps = (steps * 10U) + (uint32_t)(*p - '0');
        if (steps > STEP_MAX_COUNT)
        {
            steps = STEP_MAX_COUNT;
        }
        p++;
    }

    int reverse = 0;
    int verify = 0;
    uint32_t verify_ms = STEP_VERIFY_DEFAULT_MS;

    /* Optional trailing tokens: fwd|rev and verify [ms], in any order. */
    while (1)
    {
        while (*p == ' ')
        {
            p++;
        }
        if (*p == '\0')
        {
            break;
        }
        char c = *p;
        if (c == 'r' || c == 'R')
        {
            reverse = 1;
        }
        else if (c == 'f' || c == 'F')
        {
            reverse = 0;
        }
        else if (c == 'v' || c == 'V')
        {
            verify = 1;
            /* Skip the "verify" word, then read an optional interval in ms. */
            while (*p != '\0' && *p != ' ')
            {
                p++;
            }
            while (*p == ' ')
            {
                p++;
            }
            if (*p >= '0' && *p <= '9')
            {
                verify_ms = parse_u32_default(p, STEP_VERIFY_DEFAULT_MS);
                if (verify_ms < STEP_VERIFY_MIN_MS)
                {
                    verify_ms = STEP_VERIFY_MIN_MS;
                }
                if (verify_ms > STEP_VERIFY_MAX_MS)
                {
                    verify_ms = STEP_VERIFY_MAX_MS;
                }
                while (*p >= '0' && *p <= '9')
                {
                    p++;
                }
            }
            continue; /* p already advanced past any ms value */
        }
        else
        {
            printf("unknown option '%s' (use fwd|rev, verify [ms])\r\n", p);
            return;
        }
        while (*p != '\0' && *p != ' ') /* advance past fwd|rev token */
        {
            p++;
        }
    }

    if (steps == 0U)
    {
        printf("STEP: count=0, nothing to do\r\n");
        return;
    }

    printf("STEP: %lu step(s) dir=%s (PC10=STEP, PC11=DIR=%s) at ~%u steps/s\r\n",
           (unsigned long)steps,
           reverse ? "rev" : "fwd",
           reverse ? "HIGH" : "LOW",
           (unsigned int)(1000000U / STEP_PERIOD_US));

    if (verify)
    {
        printf("STEP verify: watching coil current on PA0 (ADC1_IN0) every %lu ms "
               "(status printed <=1/s); failure = swing drops below %u mV *after* the "
               "motor has been seen running (a slow start keeps checking; any key aborts)\r\n",
               (unsigned long)verify_ms,
               (unsigned int)MOTOR_SWING_MIN_MV);
        adc_input_init();
    }

    int motor_fault = 0;
    step_timing_t timing = {0};
    uint32_t done = stepmotor_move(steps, reverse, verify, verify_ms, &motor_fault, &timing);

    if (verify)
    {
        adc_input_deinit();
        /* Prove the in-line coil-current verify never disturbed the pulse train:
         * overruns=0 means every step's verify work fit inside the low-phase budget,
         * so the STEP period stayed strict even at a very short verify interval. */
        printf("STEP timing: period=%u us (%u steps/s), verify-work worst=%lu us / budget=%lu us, "
               "overruns=%lu, status-print stalls=%lu\r\n",
               (unsigned int)STEP_PERIOD_US,
               (unsigned int)(1000000U / STEP_PERIOD_US),
               (unsigned long)timing.worst_verify_us,
               (unsigned long)timing.budget_us,
               (unsigned long)timing.overruns,
               (unsigned long)timing.stalls);
    }

    if (motor_fault)
    {
        printf("STEP FAULT: coil current went flat after %lu/%lu step(s) %s "
               "(motor not running)\r\n",
               (unsigned long)done, (unsigned long)steps, reverse ? "rev" : "fwd");
    }
    else if (done < steps)
    {
        printf("STEP aborted: %lu/%lu step(s) %s\r\n",
               (unsigned long)done, (unsigned long)steps, reverse ? "rev" : "fwd");
    }
    else
    {
        printf("STEP done: %lu step(s) %s\r\n", (unsigned long)done, reverse ? "rev" : "fwd");
    }
}

