embeddedci-com/examples/scenario-sensors-stm32/main.c
/* Bring up TIM2 in PWM-input mode on PA0 (TI1): CH1 (direct, rising) captures the
 * period, CH2 (indirect, falling) the high time, and TI1 rising resets the counter
 * (slave reset mode). Timebase is 1 MHz so a capture value is directly in us. */
static void pwm_input_init(void)
{
    uint32_t timclk = HAL_RCC_GetPCLK1Freq();
    /* APB1 timer clock is doubled unless the APB1 prescaler is 1 (PPRE1 field >= 4). */
    if (((RCC->CFGR & RCC_CFGR_PPRE1) >> RCC_CFGR_PPRE1_Pos) >= 4U)
    {
        timclk *= 2U;
    }
    uint32_t prescaler = timclk / PWM_TIM_HZ;
    if (prescaler == 0U)
    {
        prescaler = 1U;
    }

    g_pwm_tim.Instance = TIM2;
    g_pwm_tim.Init.Prescaler = prescaler - 1U;
    g_pwm_tim.Init.CounterMode = TIM_COUNTERMODE_UP;
    g_pwm_tim.Init.Period = 0xFFFFFFFFU; /* TIM2 is 32-bit; never wraps mid-period */
    g_pwm_tim.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    g_pwm_tim.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
    if (HAL_TIM_IC_Init(&g_pwm_tim) != HAL_OK)
    {
        printf("PWM monitor: TIM2 init failed\r\n");
        return;
    }

    TIM_IC_InitTypeDef sIC = {0};
    sIC.ICPolarity = TIM_ICPOLARITY_RISING;
    sIC.ICSelection = TIM_ICSELECTION_DIRECTTI; /* CH1 <- TI1: period */
    sIC.ICPrescaler = TIM_ICPSC_DIV1;
    sIC.ICFilter = 0U;
    (void)HAL_TIM_IC_ConfigChannel(&g_pwm_tim, &sIC, TIM_CHANNEL_1);

    sIC.ICPolarity = TIM_ICPOLARITY_FALLING;
    sIC.ICSelection = TIM_ICSELECTION_INDIRECTTI; /* CH2 <- TI1: high time */
    (void)HAL_TIM_IC_ConfigChannel(&g_pwm_tim, &sIC, TIM_CHANNEL_2);

    TIM_SlaveConfigTypeDef sSlave = {0};
    sSlave.SlaveMode = TIM_SLAVEMODE_RESET;
    sSlave.InputTrigger = TIM_TS_TI1FP1;
    sSlave.TriggerPolarity = TIM_TRIGGERPOLARITY_RISING;
    sSlave.TriggerPrescaler = TIM_TRIGGERPRESCALER_DIV1;
    sSlave.TriggerFilter = 0U;
    (void)HAL_TIM_SlaveConfigSynchro(&g_pwm_tim, &sSlave);

    (void)HAL_TIM_IC_Start(&g_pwm_tim, TIM_CHANNEL_1);
    (void)HAL_TIM_IC_Start(&g_pwm_tim, TIM_CHANNEL_2);
}

static void pwm_input_deinit(void)
{
    (void)HAL_TIM_IC_Stop(&g_pwm_tim, TIM_CHANNEL_1);
    (void)HAL_TIM_IC_Stop(&g_pwm_tim, TIM_CHANNEL_2);
    (void)HAL_TIM_IC_DeInit(&g_pwm_tim);
}

/* One PWM measurement. Returns 0 with freq/duty/period filled, or -1 if no full
 * PWM period is seen within PWM_MEAS_WINDOW_MS (signal lost / stuck / stalled). */
static int pwm_measure(uint32_t *freq_hz, uint32_t *duty_pct, uint32_t *period_us)
{
    uint32_t start = HAL_GetTick();

    /* Discard the first capture (partial period after we start looking), then wait
     * for a second, full period. Two edges also proves the signal actually toggles. */
    __HAL_TIM_CLEAR_FLAG(&g_pwm_tim, TIM_FLAG_CC1);
    while (!__HAL_TIM_GET_FLAG(&g_pwm_tim, TIM_FLAG_CC1))
    {
        if ((HAL_GetTick() - start) > PWM_MEAS_WINDOW_MS)
        {
            return -1;
        }
    }
    __HAL_TIM_CLEAR_FLAG(&g_pwm_tim, TIM_FLAG_CC1);
    while (!__HAL_TIM_GET_FLAG(&g_pwm_tim, TIM_FLAG_CC1))
    {
        if ((HAL_GetTick() - start) > PWM_MEAS_WINDOW_MS)
        {
            return -1;
        }
    }

    uint32_t period = HAL_TIM_ReadCapturedValue(&g_pwm_tim, TIM_CHANNEL_1);
    uint32_t high = HAL_TIM_ReadCapturedValue(&g_pwm_tim, TIM_CHANNEL_2);
    if (period == 0U)
    {
        return -1;
    }
    if (high > period)
    {
        high = period;
    }
    *period_us = period;
    *freq_hz = PWM_TIM_HZ / period;
    *duty_pct = (high * 100U) / period;
    return 0;
}

static void monitor_pwm_until_key(uint32_t period_sec)
{
    uint32_t period_ms = period_sec * 1000U;

    pwm_input_init();
    printf("monitoring PWM on PA0 (TIM2_CH1) every %lu s (press any key to stop)\r\n",
           (unsigned long)period_sec);
    printf("failure = PWM lost *after* it has been seen (no edges before the first "
           "reading just keeps waiting)\r\n");

    uint32_t next_ms = HAL_GetTick();
    uint32_t cycle = 0U;
    int pwm_seen = 0; /* latched once a cycle reads a valid PWM signal */
    while (1)
    {
        if (usart1_read_byte_nonblocking(&rx_byte))
        {
            printf("\r\nPWM monitor stopped\r\n");
            break;
        }

        uint32_t now = HAL_GetTick();
        if ((int32_t)(now - next_ms) >= 0)
        {
            cycle++;
            uint32_t freq = 0U;
            uint32_t duty = 0U;
            uint32_t per = 0U;
            if (pwm_measure(&freq, &duty, &per) == 0)
            {
                pwm_seen = 1; /* latch that the PWM has actually been running */
                printf("cycle=%lu tick=%lu ms PWM ok: freq=%lu Hz duty=%lu%% period=%lu us\r\n",
                       (unsigned long)cycle,
                       (unsigned long)now,
                       (unsigned long)freq,
                       (unsigned long)duty,
                       (unsigned long)per);
            }
            else if (!pwm_seen)
            {
                /* PWM hasn't started yet — keep waiting rather than faulting on a
                 * slow start; the signal may come on in a later cycle. */
                printf("cycle=%lu tick=%lu ms waiting: no PWM on PA0 yet (not started)\r\n",
                       (unsigned long)cycle,
                       (unsigned long)now);
            }
            else
            {
                printf("cycle=%lu tick=%lu ms failure detected: PWM lost on PA0 (signal stopped)\r\n",
                       (unsigned long)cycle,
                       (unsigned long)now);
                break; /* stop monitoring once a previously-running PWM drops out */
            }
            next_ms += period_ms;
        }
    }
    pwm_input_deinit();
}

void HAL_TIM_IC_MspInit(TIM_HandleTypeDef *htim)
{
    if (htim->Instance == TIM2)
    {
        __HAL_RCC_GPIOA_CLK_ENABLE();
        __HAL_RCC_TIM2_CLK_ENABLE();

        GPIO_InitTypeDef GPIO_InitStruct = {0};
        GPIO_InitStruct.Pin = GPIO_PIN_0; /* PA0 = TIM2_CH1 */
        GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
        /* Pull-down so a disconnected input reads low (no edges = failure detected)
         * rather than floating and decoding spurious "PWM". */
        GPIO_InitStruct.Pull = GPIO_PULLDOWN;
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
        GPIO_InitStruct.Alternate = GPIO_AF1_TIM2;
        HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
    }
}

void HAL_TIM_IC_MspDeInit(TIM_HandleTypeDef *htim)
{
    if (htim->Instance == TIM2)
    {
        __HAL_RCC_TIM2_CLK_DISABLE();
        HAL_GPIO_DeInit(GPIOA, GPIO_PIN_0);
    }
}

