embeddedci-com/examples/scenario-sensors-stm32/main.c
/* Bring up ADC1 on PA0 (ADC1_IN0) for the coil-current sense, single software-
 * triggered 12-bit conversions. PA0 is shared with the TIM2 PWM monitor above;
 * "stepmotor ... verify" uses this ADC path, "monitor pwm" uses the timer path,
 * and each configures/tears down PA0 on entry/exit so they never collide. */
static void adc_input_init(void)
{
    g_adc.Instance = ADC1;
    g_adc.Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV4;
    g_adc.Init.Resolution = ADC_RESOLUTION_12B;
    g_adc.Init.ScanConvMode = DISABLE;
    g_adc.Init.ContinuousConvMode = DISABLE;
    g_adc.Init.DiscontinuousConvMode = DISABLE;
    g_adc.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
    g_adc.Init.ExternalTrigConv = ADC_SOFTWARE_START;
    g_adc.Init.DataAlign = ADC_DATAALIGN_RIGHT;
    g_adc.Init.NbrOfConversion = 1U;
    g_adc.Init.DMAContinuousRequests = DISABLE;
    g_adc.Init.EOCSelection = ADC_EOC_SINGLE_CONV;
    if (HAL_ADC_Init(&g_adc) != HAL_OK)
    {
        printf("ADC monitor: ADC1 init failed\r\n");
        return;
    }

    ADC_ChannelConfTypeDef sChannel = {0};
    sChannel.Channel = ADC_CHANNEL_0; /* PA0 = ADC1_IN0 */
    sChannel.Rank = 1U;
    sChannel.SamplingTime = ADC_SAMPLETIME_84CYCLES; /* op-amp output settles fast */
    (void)HAL_ADC_ConfigChannel(&g_adc, &sChannel);
}

static void adc_input_deinit(void)
{
    (void)HAL_ADC_DeInit(&g_adc);
}

/* One 12-bit conversion of the coil-current sense on PA0. Returns 0..4095; on a
 * conversion timeout it returns 0 (reads as "flat", which is the safe/fault side). */
static uint16_t adc_sample(void)
{
    if (HAL_ADC_Start(&g_adc) != HAL_OK)
    {
        return 0U;
    }
    if (HAL_ADC_PollForConversion(&g_adc, 2U) != HAL_OK)
    {
        HAL_ADC_Stop(&g_adc);
        return 0U;
    }
    uint16_t v = (uint16_t)HAL_ADC_GetValue(&g_adc);
    HAL_ADC_Stop(&g_adc);
    return v;
}

void HAL_ADC_MspInit(ADC_HandleTypeDef *hadc)
{
    if (hadc->Instance == ADC1)
    {
        __HAL_RCC_GPIOA_CLK_ENABLE();
        __HAL_RCC_ADC1_CLK_ENABLE();

        GPIO_InitTypeDef GPIO_InitStruct = {0};
        GPIO_InitStruct.Pin = GPIO_PIN_0; /* PA0 = ADC1_IN0 */
        GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
    }
}

void HAL_ADC_MspDeInit(ADC_HandleTypeDef *hadc)
{
    if (hadc->Instance == ADC1)
    {
        __HAL_RCC_ADC1_CLK_DISABLE();
        HAL_GPIO_DeInit(GPIOA, GPIO_PIN_0);
    }
}

static void monitor_i2c_until_key(void)
{
    uint32_t next_print_ms = HAL_GetTick();
    float last_altitude_m = 0.0f;
    uint8_t have_prev = 0U;

    if (i2c1_ensure_init() != 0)
    {
        printf("monitor aborted: I2C1 init failed\r\n");
        return;
    }
    if (bmp280_probe_and_init(1U) != 0)
    {
        printf("monitor note: BMP280 init failed (reads may fail until sensor responds)\r\n");
    }
    if (vl53l0x_init(1U) != 0)
    {
        printf("monitor note: VL53L0X init failed (will retry during reads)\r\n");
    }
    printf("monitoring BMP280 + VL53L0X every 1 second (press any key to stop)\r\n");
    while (1)
    {
        if (usart1_read_byte_nonblocking(&rx_byte))
        {
            printf("\r\nmonitor stopped\r\n");
            break;
        }

        uint32_t now = HAL_GetTick();
        if ((int32_t)(now - next_print_ms) >= 0)
        {
            if (bmp280_read_measurement(&g_sensor.temperature_c, &g_sensor.pressure_pa, &g_sensor.altitude_m) == 0)
            {
                g_sensor.read_count++;
                int32_t temp_centi = round_float_to_centi(g_sensor.temperature_c);
                int32_t altitude_centi = round_float_to_centi(g_sensor.altitude_m);
                int32_t pressure_pa_i = round_float_to_int(g_sensor.pressure_pa);
                uint32_t temp_abs_centi = (temp_centi < 0) ? (uint32_t)(-temp_centi) : (uint32_t)temp_centi;
                uint32_t altitude_abs_centi = (altitude_centi < 0) ? (uint32_t)(-altitude_centi) : (uint32_t)altitude_centi;
                const char *trend = "-";
                if (have_prev)
                {
                    if (g_sensor.altitude_m > (last_altitude_m + 0.05f))
                    {
                        trend = "up";
                    }
                    else if (g_sensor.altitude_m < (last_altitude_m - 0.05f))
                    {
                        trend = "down";
                    }
                    else
                    {
                        trend = "flat";
                    }
                }
                printf("tick=%lu ms temp=%s%lu.%02lu C pressure=%ld Pa altitude=%s%lu.%02lu m trend=%s\r\n",
                       (unsigned long)now,
                       (temp_centi < 0) ? "-" : "",
                       (unsigned long)(temp_abs_centi / 100U),
                       (unsigned long)(temp_abs_centi % 100U),
                       (long)pressure_pa_i,
                       (altitude_centi < 0) ? "-" : "",
                       (unsigned long)(altitude_abs_centi / 100U),
                       (unsigned long)(altitude_abs_centi % 100U),
                       trend);
                last_altitude_m = g_sensor.altitude_m;
                have_prev = 1U;
            }
            else
            {
                g_sensor.read_fail_count++;
                printf("tick=%lu ms BMP280 read failed\r\n", (unsigned long)now);
                printf("BMP280 failed -> recovering I2C\r\n");
                i2c_recover();
            }
            uint16_t range_mm = 0U;
            if (vl53l0x_read_range_mm(&range_mm, 0U) == 0)
            {
                g_vl53.read_count++;
                printf("tick=%lu ms VL53L0X range=%u mm\r\n",
                       (unsigned long)now,
                       (unsigned int)range_mm);
            }
            else
            {
                g_vl53.read_fail_count++;
                printf("tick=%lu ms VL53L0X read failed\r\n", (unsigned long)now);
                printf("VL53 failed -> recovering I2C\r\n");
                i2c_recover();
            }
            next_print_ms += 1000U;
        }
    }
}

static void sensor_init_until_key(void)
{
    uint32_t next_init_ms = HAL_GetTick();
    uint32_t init_attempt = 0U;
    uint8_t did_scan = 0U;

    if (i2c1_ensure_init() != 0)
    {
        printf("sensor init aborted: I2C1 init failed\r\n");
        return;
    }
    printf("retrying BMP280 + VL53L0X every 500ms (press any key to stop)\r\n");
    while (1)
    {
        if (usart1_read_byte_nonblocking(&rx_byte))
        {
            printf("\r\nsensor init retry stopped\r\n");
            break;
        }

        uint32_t now = HAL_GetTick();
        if ((int32_t)(now - next_init_ms) >= 0)
        {
            if (did_scan == 0U)
            {
                did_scan = 1U;
                printf("one-shot I2C scan:\r\n");
                i2c_bus_scan();
            }
            init_attempt++;
            printf("sensor init attempt=%lu\r\n", (unsigned long)init_attempt);
            if (bmp280_probe_and_init(1U) == 0)
            {
                printf("BMP280 init OK (addr=0x%02X)\r\n", g_sensor.i2c_addr_7b);
            }
            else
            {
                printf("BMP280 init FAILED\r\n");
            }
            printf("VL53L0X init:\r\n");
            if (vl53l0x_init(1U) == 0)
            {
                uint16_t range_mm = 0U;
                if (vl53l0x_read_range_mm(&range_mm, 1U) == 0)
                {
                    g_vl53.read_count++;
                    printf("VL53L0X read OK range=%u mm\r\n", (unsigned int)range_mm);
                }
                else
                {
                    g_vl53.read_fail_count++;
                    printf("VL53L0X init OK, read FAILED\r\n");
                    printf("VL53 failed -> recovering I2C\r\n");
                    i2c_recover();
                }
            }
            else
            {
                printf("VL53L0X init FAILED\r\n");
            }
            next_init_ms += 500U;
        }
    }
}

